taskt/Core/Automation/Commands/JSONGroup/IJSONJSONPathProperties.dot
digraph "taskt.Core.Automation.Commands.IJSONJSONPathProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IJSONJSONPathProperties" [ label="IJSONJSONPathProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IJSONInputJContainer" [ label="IJSONInputJContainer", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IJSONInputJSONProperties" [ label="IJSONInputJSONProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleJContainer" [ label="ICanHandleJContainer", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleJSON" [ label="ICanHandleJSON", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleJSONArray" [ label="ICanHandleJSONArray", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleJSONObject" [ label="ICanHandleJSONObject", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IJSONJSONPathProperties" -> "taskt.Core.Automation.Commands.IJSONInputJContainer";
"taskt.Core.Automation.Commands.IJSONInputJContainer" -> "taskt.Core.Automation.Commands.IJSONInputJSONProperties";
"taskt.Core.Automation.Commands.IJSONInputJContainer" -> "taskt.Core.Automation.Commands.ICanHandleJContainer";
"taskt.Core.Automation.Commands.IJSONInputJSONProperties" -> "taskt.Core.Automation.Commands.ICanHandleJSON";
"taskt.Core.Automation.Commands.IJSONInputJSONProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.ICanHandleJContainer" -> "taskt.Core.Automation.Commands.ICanHandleJSONArray";
"taskt.Core.Automation.Commands.ICanHandleJContainer" -> "taskt.Core.Automation.Commands.ICanHandleJSONObject";
"taskt.Core.Automation.Commands.ICanHandleJSON" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.ICanHandleJSONArray" -> "taskt.Core.Automation.Commands.ICanHandleJSON";
"taskt.Core.Automation.Commands.ICanHandleJSONObject" -> "taskt.Core.Automation.Commands.ICanHandleJSON";
}
